// // 1. Вивести на сторінку в один рядок через кому числа від 10 до 20.

let a1 = 10;
let a2 = 20;

document.write('<b>1. Числа від 10 від 20:</b> ');

for(i = a1; i <= a2; i++) {
    if(i == a2) {
        document.write(i);
    } else {
        document.write(i + ', ');
    }
}


// // 2. Вивести квадрати чисел від 10 до 20.

let b1 = 10;
let b2 = 20;

document.write('<br><br><b>2. Квадрати чисел від 10 до 20:</b> ');

for(i = b1; i <= b2; i++) {
    if(i == b2) {
        document.write(i*i);
    } else {
        document.write(i*i + ', ');
    }
}


// // 3. Вивести таблицю множення на 7.

let c = 11;

document.write('<br><br><b>3. Таблиця множення на 7:</b><br>');

for(let i = 0; i < c; i++) {
    document.write(`${i}*7 = ${i*7}<br>`);
}


// // 4. Знайти суму всіх цілих чисел від 1 до 15.

let sum1 = 0;

for(let i = 1; i <= 15; i++) {
    sum1 += i;
}
document.write(`<br><b>4. Сума всіх цілих чисел від 1 до 15:</b> ${sum1}`);


// // 5. Знайти добуток усіх цілих чисел від 15 до 35.

let d1 = 15;
let d2 = 35;
let res1 = 1;

for(i = d1; i <= d2; i++) {
    res1 *= i;
}
document.write(`<br><br><b>5. Добуток усіх цілих чисел від 15 до 35:</b> ${res1}`);


// // 6. Знайти середнє арифметичне всіх цілих чисел від 1 до 500.

let e1 = 1;
let e2 = 500;
let sum2 = 0;

for(i = e1; i <= e2; i++) {
    sum2 += i;
}
document.write(`<br><br><b>6. Середнє арифметичне всіх цілих чисел від 1 до 500:</b> ${sum2/e2}`)
    

// 7. Вивести суму лише парних чисел в діапазоні від 30 до 80.

let sum3 = 0;

for(let i = 30; i <= 80; i++) {
    if(i % 2 == 0) {
        sum3 += i;
    }
}
document.write(`<br><br><b>7. Сума лише парних чисел в діапазоні від 30 до 80:</b> ${sum3}`);


// 8. Вивести всі числа в діапазоні від 100 до 200 кратні 3.

let g1 = 100;
let g2 = 200;

document.write('<br><br><b>8. Всі числа в діапазоні від 100 до 200 кратні 3:</b> ')
for(i = g1; i <= g2; i++) {
    if(i % 3 == 0) {
        if(i == g2) {
            document.write(i);
        } else {
            document.write(i + ', ');
        }
    }
}


// 9. Дано натуральне число. Знайти та вивести на сторінку всі його дільники.

let h = +prompt('Enter a number for tasks 9-11');

document.write(`<br><br><b>9. Всі дільники числа ${h}:</b> `)

for(let i = 0; i <= h; i++) {
    if(h % i == 0) {
        if(i == h) {
            document.write(i);
        } else {
            document.write(i + ', ');
        }
    }
}


// 10. Визначити кількість його парних дільників.

let even = 0;

for(let i = 0; i <= h; i++) {
    if (i % 2 == 0) {
        if(h % i == 0) {
            even += 1;
        }
    }
}
document.write(`<br><br><b>10. Кількість парних дільників ${h}:</b> ${even}`);


// 11. Знайти суму його парних дільників.

let sumOfEven = 0;
for(let i = 0; i <= h; i++) {
    if (i % 2 == 0) {
        if(h % i == 0) {
            sumOfEven += i;
        }
    }
}
document.write(`<br><br><b>11. Сума парних дільників ${h}:</b> ${sumOfEven}`);


// 12. Надрукувати повну таблицю множення від 1 до 10.

document.write('<br><br><b>12. Повна таблиця множення від 1 до 10:</b><br><br>')

let k = 0;
while(k < 10) {
    k++
    for(let i = 1; i < 11; i++) {
        document.write(`${k}*${i} = ${k*i}<br>`);
    }
    document.write('<br>');
}


// 13. Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).

document.write('<b>13. Числа від 20 до 30 з кроком 0,5:</b> ');
for (let i = 20; i <= 30; i += 0.5) {
        document.write(i + ' ');
}


// 14. Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

document.write('<br><br><b>14. Перевод вартості від 10 до 100 (з кроком 10) з доларів у гривні:</b><br> ');

for(let i = 10; i <= 100; i += 10) {
    document.write(`${i}$ = ${i*27}₴<br>`);
}


// 15. Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.

let n = +prompt('Enter your number for task 15');

document.write(`<br><b>15. Всі цілі числа, квадрат яких не перевищує ${n}:</b> `)
for(i = 1; i <= 100; i++) {
    if (i**2 <= n) {
        if((i+1)**2 > n) {
            document.write(i);
        } else {
            document.write(i + ", ");
        }
    }
}


// 16. Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).

let p = +prompt('Enter your number for task 16');

document.write(`<br><br><b>Число ${p}:</b> `) 
if(p <= 1) {
    document.write('Не може бути простим, адже простим називається числа, більше 1, які не мають інших дільників крім 1 і себе')
} else {
    for(let i = 2; i < p; i++) {
        if(p % i == 0) {
            document.write('Не просте');
            break;
        } else {
            document.write('Просте');
            break;
        }
    }
}


// 17. Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

let r = +prompt('Enter your number for task 17');

document.write(`<br><br><b>Число ${r}:</b> `)
while (r % 3 == 0) {
    r /= 3;
}
document.write((r == 1)? `можна отримати шляхом зведення 3 у деякий ступінь` : `не можна отримати шляхом зведення 3 у деякий ступінь`);